In [13]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [14]:
from kafkanator import gini_per_cluster

In [15]:
workers = pd.read_csv('./data/salaries.csv',sep=',',header=0)

In [16]:
workers

   id  experience diploma  salary
0   1           2       A    1000
1   2           3       A    2000
2   3           4       B    4000
3   4           5       B    3500
4   5           4       A    8000
5   6           1       B    2000
6   7           3       C    4000
7   8           4       C    5000
8   9           5       B    2000
9  10           1       A    5000

In [17]:
gns = gini_per_cluster(workers,'diploma','salary')

sorted incomes  C   [4000, 5000]
sorted incomes  A   [1000, 2000, 5000, 8000]
sorted incomes  B   [2000, 2000, 3500, 4000]

In [18]:
print(gns)

[('C', 0.05555555555555555), ('A', 0.375), ('B', 0.16304347826086957)]